const allCrystals = document.querySelector(".crystals");
const test = document.querySelector(".test");
const desc_desc = document.querySelector(".desc_desc");

const crystals = [
  {
    title: "ავანტურინი",
    img: "test1.webp",
    test: [
      {
        title: ` აღწერა `,
        desk: " ავენტურინი არის კვარცის ფორმა, რომელიც ხასიათდება მისი მწვანედან მოლურჯო-მომწვანო შეფერილობით და პაწაწინა მეტალის ჩანართების არსებობით, რომლებიც ქმნიან ცქრიალა ან მოციმციმე ეფექტს, რომელიც ცნობილია როგორც . ეს არის პოპულარული და მრავალმხრივი ძვირფასი ქვა, რომელიც გამოიყენება სხვადასხვა სახის სამკაულებსა და ჩუქურთმებში. ",
      },
      {
        title: ` ჩაკრა `,
        desk: ` ავენტურინი პირველ რიგში ასოცირდება გულის ჩაკრასთან (ანაჰატა). გულის ჩაკრა დაკავშირებულია სიყვარულთან, თანაგრძნობასთან და ემოციურ კეთილდღეობასთან. `,
      },
      {
        title: ` მაგიური შესაძლებლობები  `,
        desk: ` ავენტურინი გამოიყენება სხვადასხვა მაგიური და მეტაფიზიკური მიზნებისთვის, მათ შორის: `,
      },
      {
        title: ` განკურნება და კომფორტი `,
        desk: ` ითვლება, რომ ის ხელს უწყობს განკურნებას, კომფორტს და ემოციურ წონასწორობას. `,
      },
      {
        title: ` კეთილდღეობა `,
        desk: ` ავენტურინი ხშირად ასოცირდება სიუხვისა და კეთილდღეობის მოზიდვასთან. `,
      },
      {
        title: ` ენერგიის ჰარმონიზაცია `,
        desk: ` მას შეუძლია ენერგიის ჰარმონიზაცია და დაბალანსება.`,
      },
      {
        title: ` კრეატიულობა `,
        desk: `  ავენტურინი ასტიმულირებს შემოქმედებითობას და მხატვრულ გამოხატვას. `,
      },
      {
        title: ` დაცვა `,
        desk: `  ზოგი იყენებს მას უარყოფითი ენერგიებისგან დასაცავად. `,
      },
      {
        title: ` ჯანმრთელობის გამოყენება `,
        desk: ` ავენტურინი ასტიმულირებს შემოქმედებითობას და მხატვრულ გამოხატვას. `,
      },
      {
        title: ` ემოციური კეთილდღეობა  `,
        desk: ` ეს ხელს უწყობს ემოციურ წონასწორობას, სტაბილურობას და კომფორტს. `,
      },
    ],
  },
  {
    title: "ავანტურინი",
    img: "test1.webp",
    test: [
      {
        title: ` აღწერა `,
        desk: ` ავენტურინი არის კვარცის ფორმა, რომელიც ხასიათდება მისი მწვანედან მოლურჯო-მომწვანო შეფერილობით და პაწაწინა მეტალის ჩანართების არსებობით, რომლებიც ქმნიან ცქრიალა ან მოციმციმე ეფექტს, რომელიც ცნობილია როგორც "ავანტიურესცენცია". ეს არის პოპულარული და მრავალმხრივი ძვირფასი ქვა, რომელიც გამოიყენება სხვადასხვა სახის სამკაულებსა და ჩუქურთმებში. `,
      },
      {
        title: ` ჩაკრა `,
        desk: ` ავენტურინი პირველ რიგში ასოცირდება გულის ჩაკრასთან (ანაჰატა). გულის ჩაკრა დაკავშირებულია სიყვარულთან, თანაგრძნობასთან და ემოციურ კეთილდღეობასთან. `,
      },
      {
        title: ` მაგიური შესაძლებლობები  `,
        desk: ` ავენტურინი გამოიყენება სხვადასხვა მაგიური და მეტაფიზიკური მიზნებისთვის, მათ შორის: `,
      },
      {
        title: ` განკურნება და კომფორტი `,
        desk: ` ითვლება, რომ ის ხელს უწყობს განკურნებას, კომფორტს და ემოციურ წონასწორობას. `,
      },
      {
        title: ` კეთილდღეობა `,
        desk: ` ავენტურინი ხშირად ასოცირდება სიუხვისა და კეთილდღეობის მოზიდვასთან. `,
      },
      {
        title: ` ენერგიის ჰარმონიზაცია `,
        desk: ` მას შეუძლია ენერგიის ჰარმონიზაცია და დაბალანსება.`,
      },
      {
        title: ` კრეატიულობა `,
        desk: `  ავენტურინი ასტიმულირებს შემოქმედებითობას და მხატვრულ გამოხატვას. `,
      },
      {
        title: ` დაცვა `,
        desk: `  ზოგი იყენებს მას უარყოფითი ენერგიებისგან დასაცავად. `,
      },
      {
        title: ` ჯანმრთელობის გამოყენება `,
        desk: ` ავენტურინი ასტიმულირებს შემოქმედებითობას და მხატვრულ გამოხატვას. `,
      },
      {
        title: ` ემოციური კეთილდღეობა  `,
        desk: ` ეს ხელს უწყობს ემოციურ წონასწორობას, სტაბილურობას და კომფორტს. `,
      },
    ],
  },
  {
    title: "ავანტურინი",
    img: "test1.webp",
    test: [
      {
        title: ` აღწერა `,
        desk: ` ავენტურინი არის კვარცის ფორმა, რომელიც ხასიათდება მისი მწვანედან მოლურჯო-მომწვანო შეფერილობით და პაწაწინა მეტალის ჩანართების არსებობით, რომლებიც ქმნიან ცქრიალა ან მოციმციმე ეფექტს, რომელიც ცნობილია როგორც "ავანტიურესცენცია". ეს არის პოპულარული და მრავალმხრივი ძვირფასი ქვა, რომელიც გამოიყენება სხვადასხვა სახის სამკაულებსა და ჩუქურთმებში. `,
      },
      {
        title: ` ჩაკრა `,
        desk: ` ავენტურინი პირველ რიგში ასოცირდება გულის ჩაკრასთან (ანაჰატა). გულის ჩაკრა დაკავშირებულია სიყვარულთან, თანაგრძნობასთან და ემოციურ კეთილდღეობასთან. `,
      },
      {
        title: ` მაგიური შესაძლებლობები  `,
        desk: ` ავენტურინი გამოიყენება სხვადასხვა მაგიური და მეტაფიზიკური მიზნებისთვის, მათ შორის: `,
      },
      {
        title: ` განკურნება და კომფორტი `,
        desk: ` ითვლება, რომ ის ხელს უწყობს განკურნებას, კომფორტს და ემოციურ წონასწორობას. `,
      },
      {
        title: ` კეთილდღეობა `,
        desk: ` ავენტურინი ხშირად ასოცირდება სიუხვისა და კეთილდღეობის მოზიდვასთან. `,
      },
      {
        title: ` ენერგიის ჰარმონიზაცია `,
        desk: ` მას შეუძლია ენერგიის ჰარმონიზაცია და დაბალანსება.`,
      },
      {
        title: ` კრეატიულობა `,
        desk: `  ავენტურინი ასტიმულირებს შემოქმედებითობას და მხატვრულ გამოხატვას. `,
      },
      {
        title: ` დაცვა `,
        desk: `  ზოგი იყენებს მას უარყოფითი ენერგიებისგან დასაცავად. `,
      },
      {
        title: ` ჯანმრთელობის გამოყენება `,
        desk: ` ავენტურინი ასტიმულირებს შემოქმედებითობას და მხატვრულ გამოხატვას. `,
      },
      {
        title: ` ემოციური კეთილდღეობა  `,
        desk: ` ეს ხელს უწყობს ემოციურ წონასწორობას, სტაბილურობას და კომფორტს. `,
      },
    ],
  },
];

for (let index = 0; index < crystals.length; index++) {
  const element = crystals[index];

  const template = `
        <div class="crystal_item">
        <div class="interact">
            <div class="crystal_img" style="background: url(../../img/crystals/${element.img}) center"></div>
            <div class="more"> ვრცლად </div>
        </div>
        <div class="crystal_title">${element.title}</div>
        </div>
    `;
  allCrystals.innerHTML += template;
}

const more = document.querySelectorAll(".more");
more.forEach((more, index) => {
  more.addEventListener("click", () => {
    let html = "";
    crystals[index].test.forEach((item) => {
      html += `<div> <span style="font-weight: 600; font-size : 22px"> ${item.title} </span> :  ${item.desk}</div> <br>`;
    });

    test.innerHTML = html;

    desc_desc.style.display = "flex";
    allCrystals.style.display = "none";
  });
});

const close = document.querySelector(".close");
close.addEventListener("click", () => {
  test.innerHTML = "";
  desc_desc.style = "display: none";
  allCrystals.style = "display: grid";
});
